setup/load_testing/load-testing-q.yml
config:
  target: "http://localhost:8080"
  http:
    pool: 10
    timeout: 2
  phases:
    - duration: 30
      arrivalRate: 200
      name: 200 users/sec
    - duration: 30
      arrivalRate: 200
      rampTo: 300
      name: Ramp to 300 users
    - duration: 30
      arrivalRate: 300
      name: 300 users/sec
    - duration: 30
      arrivalRate: 300
      rampTo: 400
      name: Ramp to 400 users
    - duration: 30
      arrivalRate: 400
      name: 400 users/sec
    - duration: 30
      arrivalRate: 400
      rampTo: 500
      name: Ramp to 500 users
    - duration: 60
      arrivalRate: 500
      name: 500 users/sec  
      

scenarios:
  - name: Get movies by id 1
    weight: 35
    flow:
    - get:
        url: "/movies/66363e769a6159df629d23c9"
  - name: Get movies by id 2
    weight: 35
    flow:
    - get:
        url: "/movies/66363e769a6159df629d23ca"
  - name: Get movies by page
    weight: 20
    flow:
    - get:
        url: "/movies?page={{$randomNumber(1,50)}}"
  - name: Save new movie
    weight: 10
    flow:
    - post:
        url: "/movies"
        json:
            poster: "{{$randomString()}}"
            title: "{{$randomString()}}"
            releasedYear: "{{$randomNumber(1950,2020)}}"
            certificate: "{{$randomString()}}"
            runtime: "{{$randomString()}}"
            genre: "{{$randomString()}}"
            rating: "0.0"
            overview: "{{$randomString()}}"
            director: "{{$randomString()}}"